In [1]:
import pandas as pd

# DATA SERIES

pandas Series one-demensional labeled array

In [28]:
ser = pd.Series([100,200,300,400,500],["dan hauer","harry potter", "Jay z","Rihana","JB"])

In [29]:
ser

dan hauer       100
harry potter    200
Jay z           300
Rihana          400
JB              500
dtype: int64

In [30]:
type(ser)

pandas.core.series.Series

In [31]:
#xem index
ser.index

Index(['dan hauer', 'harry potter', 'Jay z', 'Rihana', 'JB'], dtype='object')

In [32]:
ser["JB"]

500

In [33]:
ser[[1,3,4]]

harry potter    200
Rihana          400
JB              500
dtype: int64

In [34]:
"harry potter" in ser

True

In [35]:
ser*2

dan hauer        200
harry potter     400
Jay z            600
Rihana           800
JB              1000
dtype: int64

In [36]:
ser

dan hauer       100
harry potter    200
Jay z           300
Rihana          400
JB              500
dtype: int64

In [37]:
 ser["harry potter"] ** 4

1600000000

In [38]:
ser

dan hauer       100
harry potter    200
Jay z           300
Rihana          400
JB              500
dtype: int64

# Pandas DataFrame

pandas DataFrame is a 2-dimensional labeled data structure

create Dataframe from Dictionary of Python Series

In [50]:
dict={ "one": pd.Series([222,333,444,555],index=["hai","ba","bon","nam"]),
            "two": pd.Series([7000,8000,9000,10000,110000],["hai","bon","sau","tam","muoi"])}

In [51]:
type(dict)

dict

Okay okay After this step we'll transform dictionary to DataFrame

In [52]:
DF = pd.DataFrame(dict)
DF

        one       two
ba    333.0       NaN
bon   444.0    8000.0
hai   222.0    7000.0
muoi    NaN  110000.0
nam   555.0       NaN
sau     NaN    9000.0
tam     NaN   10000.0

In [53]:
type(DF)

pandas.core.frame.DataFrame

In [54]:
DF.index

Index(['ba', 'bon', 'hai', 'muoi', 'nam', 'sau', 'tam'], dtype='object')

In [55]:
DF.values

array([[    333.,      nan],
       [    444.,    8000.],
       [    222.,    7000.],
       [     nan,  110000.],
       [    555.,      nan],
       [     nan,    9000.],
       [     nan,   10000.]])

In [56]:
DF.columns

Index(['one', 'two'], dtype='object')

In [60]:
pd.DataFrame(dict,index=["lol","ba","bon"])

       one     two
lol    NaN     NaN
ba   333.0     NaN
bon  444.0  8000.0

In [63]:
pd.DataFrame(dict,index=["lol","ba","bon"],columns=["new1","two","one"])

    new1     two    one
lol  NaN     NaN    NaN
ba   NaN     NaN  333.0
bon  NaN  8000.0  444.0

# Create DataFrame from list of Python dictionaries

In [67]:
data=[{'alex':1,"joe":2,"alice":55},{"ema":3,"alice":5}]
type(data)

list

In [68]:
pd.DataFrame(data)

   alex  alice  ema  joe
0   1.0     55  NaN  2.0
1   NaN      5  3.0  NaN

In [76]:
pd.DataFrame(data,columns=["alex","alice"])

   alex  alice
0   1.0     55
1   NaN      5

In [77]:
# Basic DataFrame Operation

In [78]:
DF

        one       two
ba    333.0       NaN
bon   444.0    8000.0
hai   222.0    7000.0
muoi    NaN  110000.0
nam   555.0       NaN
sau     NaN    9000.0
tam     NaN   10000.0

In [81]:
DF["one"]

ba      333.0
bon     444.0
hai     222.0
muoi      NaN
nam     555.0
sau       NaN
tam       NaN
Name: one, dtype: float64

In [82]:
DF["three"]=DF["two"]+DF["one"]

In [83]:
DF

        one       two   three
ba    333.0       NaN     NaN
bon   444.0    8000.0  8444.0
hai   222.0    7000.0  7222.0
muoi    NaN  110000.0     NaN
nam   555.0       NaN     NaN
sau     NaN    9000.0     NaN
tam     NaN   10000.0     NaN

In [84]:
DF["THREE Khong am "]=DF["three"]>0
DF

        one       two   three  THREE Khong am
ba    333.0       NaN     NaN            False
bon   444.0    8000.0  8444.0             True
hai   222.0    7000.0  7222.0             True
muoi    NaN  110000.0     NaN            False
nam   555.0       NaN     NaN            False
sau     NaN    9000.0     NaN            False
tam     NaN   10000.0     NaN            False

In [85]:
DF["trash"]=DF["three"]/DF["two"]
DF

        one       two   three  THREE Khong am      trash
ba    333.0       NaN     NaN            False       NaN
bon   444.0    8000.0  8444.0             True  1.055500
hai   222.0    7000.0  7222.0             True  1.031714
muoi    NaN  110000.0     NaN            False       NaN
nam   555.0       NaN     NaN            False       NaN
sau     NaN    9000.0     NaN            False       NaN
tam     NaN   10000.0     NaN            False       NaN

# Co 2 cach xoa cot

DEl va POP

In [88]:
temp=DF.pop("trash")

In [89]:
DF

        one       two   three  THREE Khong am
ba    333.0       NaN     NaN            False
bon   444.0    8000.0  8444.0             True
hai   222.0    7000.0  7222.0             True
muoi    NaN  110000.0     NaN            False
nam   555.0       NaN     NaN            False
sau     NaN    9000.0     NaN            False
tam     NaN   10000.0     NaN            False

In [90]:
DF["trash"]=DF["three"]/DF["two"]
DF

        one       two   three  THREE Khong am      trash
ba    333.0       NaN     NaN            False       NaN
bon   444.0    8000.0  8444.0             True  1.055500
hai   222.0    7000.0  7222.0             True  1.031714
muoi    NaN  110000.0     NaN            False       NaN
nam   555.0       NaN     NaN            False       NaN
sau     NaN    9000.0     NaN            False       NaN
tam     NaN   10000.0     NaN            False       NaN

In [91]:
del DF["trash"]
DF

        one       two   three  THREE Khong am
ba    333.0       NaN     NaN            False
bon   444.0    8000.0  8444.0             True
hai   222.0    7000.0  7222.0             True
muoi    NaN  110000.0     NaN            False
nam   555.0       NaN     NaN            False
sau     NaN    9000.0     NaN            False
tam     NaN   10000.0     NaN            False

In [94]:
DF.insert(3,"copy_of_one1",DF["one"])
DF

        one  copy_of_one       two  copy_of_one1   three  THREE Khong am
ba    333.0        333.0       NaN         333.0     NaN            False
bon   444.0        444.0    8000.0         444.0  8444.0             True
hai   222.0        222.0    7000.0         222.0  7222.0             True
muoi    NaN          NaN  110000.0           NaN     NaN            False
nam   555.0        555.0       NaN         555.0     NaN            False
sau     NaN          NaN    9000.0           NaN     NaN            False
tam     NaN          NaN   10000.0           NaN     NaN            False

In [95]:
del DF["copy_of_one1"]
DF

        one  copy_of_one       two   three  THREE Khong am
ba    333.0        333.0       NaN     NaN            False
bon   444.0        444.0    8000.0  8444.0             True
hai   222.0        222.0    7000.0  7222.0             True
muoi    NaN          NaN  110000.0     NaN            False
nam   555.0        555.0       NaN     NaN            False
sau     NaN          NaN    9000.0     NaN            False
tam     NaN          NaN   10000.0     NaN            False

In [98]:
del DF["last_one"]
DF
DF["last_one"]=DF["one"][:2] #van chua hieu cho [:2] lam gi luon a' @@
DF

        one  copy_of_one       two   three  THREE Khong am   last_one
ba    333.0        333.0       NaN     NaN            False     333.0
bon   444.0        444.0    8000.0  8444.0             True     444.0
hai   222.0        222.0    7000.0  7222.0             True       NaN
muoi    NaN          NaN  110000.0     NaN            False       NaN
nam   555.0        555.0       NaN     NaN            False       NaN
sau     NaN          NaN    9000.0     NaN            False       NaN
tam     NaN          NaN   10000.0     NaN            False       NaN